app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 8]]
---
            <h3><%= @user.first_name + " " + @user.last_name %>'s Created Events</h3>
                          <%@user.events.each do |event| %>